{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "b8969e6f",
   "metadata": {},
   "outputs": [],
   "source": [
    "import torch\n",
    "from transformers import pipeline\n",
    "import os"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b0f3b7b0",
   "metadata": {},
   "outputs": [],
   "source": [
    "from transformers import AutoModelForSeq2SeqLM, T5TokenizerFast\n",
    "\n",
    "# Зададим название выбронной модели из хаба\n",
    "MODEL_NAME = 'UrukHan/t5-russian-summarization'\n",
    "MAX_INPUT = 256\n",
    "\n",
    "# Загрузка модели и токенизатора\n",
    "tokenizer = T5TokenizerFast.from_pretrained(MODEL_NAME)\n",
    "model = AutoModelForSeq2SeqLM.from_pretrained(MODEL_NAME)\n",
    "\n",
    "# Входные данные (можно массив фраз или текст)\n",
    "input_sequences = ['Запад после начала российской специальной операции по демилитаризации Украины ввел несколько раундов новых экономических санкций. В Кремле новые ограничения назвали серьезными, но отметили, что Россия готовилась к ним заранее.']   # или можно использовать одиночные фразы:  input_sequences = 'сеглдыя хорош ден'\n",
    "\n",
    "def gen(input_sequences):\n",
    "    task_prefix = \"Spell correct: \"                 # Токенизирование данных\n",
    "    if type(input_sequences) != list: input_sequences = [input_sequences]\n",
    "    encoded = tokenizer(\n",
    "      [task_prefix + sequence for sequence in input_sequences],\n",
    "      padding=\"longest\",\n",
    "      max_length=MAX_INPUT,\n",
    "      truncation=True,\n",
    "      return_tensors=\"pt\",\n",
    "    )\n",
    "\n",
    "    predicts = model.generate(**encoded)    # # Прогнозирование\n",
    "\n",
    "    txt = tokenizer.batch_decode(predicts, skip_special_tokens=True)  # Декодируем данные\n",
    "    return txt "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "f5b904c1",
   "metadata": {},
   "outputs": [],
   "source": [
    "text = \"\"\"Я прохожу обучение в онлайн школе Geekbrains на курсе «Программист разработчик» с получением в будущем специализации «Сетевой инженер». Хочу поделиться своими впечатлениями о курсе и организации учебного процесса.\n",
    "У меня есть высшее образование по направлению — педагогика. И я не по наслышке знаю, как не просто организовать учебный процесс, тем более дистанционный.\n",
    "Прежде всего, стоит отметить, что учёба в онлайн формате предполагает не только следование программе курса /а она построена хорошо/, но и значительную самостоятельную работу. Никто не отменял необходимость изучения дополнительных материалов и глубокого погружения в тему. Это очень важно для полноценного освоения профессии и умения решать практические задачи.\n",
    "Особо хочется выразить благодарность нашему преподавателю, Ильнару Шафигуллину. Его профессионализм, глубокие знания предмета и умение доступно объяснять сложные вопросы делают процесс обучения максимально эффективным и интересным. Ильнар всегда готов помочь и ответить на вопросы, что делает обучение особенно ценным. Поверьте мне — хорошее преподование дано не многим, это Дар Божий. Ильнар один тех, кому повезло найти своё призвание и настоящее место в жизни, спасибо Вам.\n",
    "Не могу не отметить также качество технической поддержки и помощь в телеграмм-канале группы. Техподдержка отзывчива и оперативно решает любые возникающие вопросы, что существенно упрощает процесс обучения и позволяет сконцентрироваться на изучении материала. Иногда запаздывает поддержка наставников, но всегда должно быть что-то, что нужно улучшить, это процесс.\n",
    "В целом, обучение в Geekbrains оставляет очень положительные впечатления. Курс организован профессионально, а обучение дополняется необходимой поддержкой как со стороны преподавателей, так и технической службы. Это отличный выбор для тех, кто хочет погрузиться в мир IT и приобрести необходимые для карьеры навыки.\n",
    "Надо помнить — путь в IT связан с пожизненым, постоянным профессиональным ростом, учиться будете всегда!\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "27ad1857",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['«Самый успешный в мире преподаватель»: Ильнар Шафигуллин о курсе Geekbrains']\n"
     ]
    }
   ],
   "source": [
    "txt = gen(text)\n",
    "print(txt)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "76cc7009",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
